{
  "basics": {
    "name": "Ted Ryan Cox",
    "label": "Web Developer",
    "picture": "https://i.imgur.com/wC9zHJr.jpg",
    "email": "tr.coxy@gmail.com",
    "phone": "(918)857-1080",
    "website": "http://ryancox.io",
    "summary": "I am a self-motivated Web Development professional. I work hard to find sensible solutions to both small and complex problems. I have 4+ years of API integration experience where solving these types of problems is an everyday occurrence. I am passionate about continuing my growth as a developer by learning new technologies and practices. I desire a position within a company that can help facilitate this growth.",
    "location": {
      "address": "1311 W Hot Springs St",
      "postalCode": "74011",
      "city": "Broken Arrow",
      "countryCode": "US",
      "region": "OK"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "CyanTrox",
        "url": "https://twitter.com/CyanTrox",
        "icon": "fab fa-twitter"
      },
      {
        "network": "GitHub",
        "username": "Croxy",
        "url": "https://github.com/Croxy",
        "icon": "fab fa-github"
      }
    ]
  },
  "work": [
    {
      "company": "Bluefin Payment Systems",
      "position": "Integration Engineer",
      "website": "https://www.bluefin.com/",
      "startDate": "2013-09-18",
      "endDate": "",
      "summary": "At Bluefin Payment Systems I work as an Integration Engineer. In this position, I am the technical face of Bluefin to its customers and am tasked with guiding them through their API integration experience.",
      "highlights": [
        "Hired as the first Integration employee in the company; tasked with developing processes for both internal and external client management and communication.",
        "Consulted with our client’s developers to identify their companies business needs, and helped them not only identify the best API calls to use but also helped them architect internal solutions on their end to maximize their use of the APIs.",
        "Created procedures for assisting integrating partners with debugging API integration issues.",
        "Worked on multiple high-profile merchant integrations to Bluefin's PayConex payment gateway and Decryptx APIs.  Helped individual merchants, payment gateways, and payment device manufacturers utilize Bluefin’s family of APIs.",
        "Established processes for API certification for integrating partners.",
        "Worked alongside the Bluefin development department to understand core functionality of various products in order to provide clear and concise guidance integrating partners. This included writing example code and supplemental documentation.",
        "Assisted the Bluefin Quality Assurance team with bug reporting and user acceptance testing.",
        "Digested multiple credit card reader specifications and created JavaScript helper functions for client use. Created multiple web application tools to assist developers with understanding the APIs at a deeper level. These applications are often used by Bluefin's internal development and quality assurance teams as well as by the integrating partners.",
        "Served as a technical sales engineer for high-value prospective customers."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Oklahoma State University",
      "area": "Marketing/Management Science Information Systems",
      "description": "At Oklahoma State University I pursued a double major. My majors were Marketing and Management Science Information Systems. Learning to bridge the gaps between customer-focused business practices and the technologies that enable them were the motivating factors behind this decision.",
      "studyType": "Bachelor of Science",
      "startDate": "2010-05-01",
      "endDate": "2013-05-04",
      "gpa": "2.8",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "Employee Appreciation Award",
      "date": "2017-12-20",
      "awarder": "Bluefin Payment Systems",
      "summary": "In 2017, I was recognized by Bluefin as having exceeded the organization's expectations. During this year, I assisted in many client integrations, and I developed API tools and supplemental API tutorials."
    }
  ],
  "publications": [],
  "skills": [
    {
      "name": "Web Development",
      "level": "Intermediate",
      "keywords": [
        "HTML",
        "CSS",
        "JavaScript",
        "PHP",
        "MySQL",
        "Git",
        "Docker",
        "Linux"
      ]
    },
    {
      "name": "API Integration",
      "level": "Expert",
      "keywords": [
        "Reading/understanding technical API documentation.",
        "Writing supplemental API documentation.",
        "Creating code examples for API requests.",
        "Developing REST API test cases.",
        "Troubleshooting/debugging integrations."
      ]
    }
  ],
  "languages": [
    {
      "name": "English",
      "level": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Music",
      "keywords": [
        "I have been playing guitar since childhood. I enjoy learning new techniques and information to make myself a better player. I also enjoy going to see live music whenever I get the chance."
      ]
    },
    {
      "name": "Outdoors",
      "keywords": [
        "Growing in a rural area, I developed a fondness for the outdoors. I enjoy spending time hiking, hunting, and fishing."
      ]
    },
    {
      "name": "Martial Arts",
      "keywords": [
        "I was introduced to Brazilian Jiu-Jitsu while attending Oklahoma State University. I joined the club hoping it would be an active hobby I would enjoy. This introduction blossomed into a love of the sport, and I attend classes regularly in my available time."
      ]
    }
  ],
  "references": [
    {
      "name": "Trevor Hermosillo",
      "company": "Google",
      "position": "Hardware Engineer",
      "phone": "(918)863-9365",
      "email": "thermosillo@google.com"
    },
    {
      "name": "Ryan Garret",
      "company": "QuickTrip",
      "position": "Sr Cyber Security Analyst",
      "phone": "(918)863-9365",
      "email": "ryanjamesgarrett@gmail.com"
    },
    {
      "name": "Chris Miyata",
      "company": "Bank of Oklahoma",
      "position": "Product Manager Debit Card",
      "phone": "(918)508-9830",
      "email": "chrismiyata@gmail.com"
    }
  ]
}