{
  "basics": {
    "name": "Ted Ryan Cox",
    "label": "Web Developer",
    "picture": "https://i.imgur.com/wC9zHJr.jpg",
    "email": "tr.coxy@gmail.com",
    "phone": "(918)857-1080",
    "website": "http://ryancox.io",
    "summary": "I am a self-motivated Web Development professional. I work hard to find sensible solutions to both small and complex problems. I have 7+ years of payment API integration experience where solving these types of problems is an everyday occurrence. I am passionate about continuing my growth as a developer by learning new technologies and practices. I desire a position within a company that can help facilitate this growth.",
    "location": {
      "address": "1311 W Hot Springs St",
      "postalCode": "74011",
      "city": "Broken Arrow",
      "countryCode": "US",
      "region": "OK"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "Croxy",
        "url": "https://github.com/Croxy",
        "icon": "fab fa-github"
      }
    ]
  },
  "work": [
    {
      "company": "Bluefin Payment Systems",
      "position": "Integration Engineer",
      "website": "https://www.bluefin.com/",
      "startDate": "2013-09-18",
      "endDate": "",
      "summary": "At Bluefin Payment Systems I work as an Integration Engineer. In this position, I am the technical face of Bluefin to its customers and am tasked with guiding them through their API integration experience.",
      "highlights": [
        "Hired as the first Integration employee in the company; tasked with developing processes for both internal and external client management and communication.",
        "Consulted with integrating developers to identify their companies business needs and assisted them with the best integration paths using Bluefin's API suite and products.",
        "Assisted integrating partners with debugging API integration issues.",
        "Established processes for API certification for integrating partners.",
        "Worked alongside the Bluefin development department to understand core functionality of various products in order to provide clear and concise guidance to integrating partners. This included writing example code and supplemental documentation.",
        "Assisted the Bluefin Quality Assurance team with bug reporting and user acceptance testing.",
        "Digested multiple credit card reader specifications and created JavaScript functions for client use in parsing and using these devices.",
        "Created multiple web application utilities using PHP, CSS, and JavaScript to assist developers with understanding the Bluefin API suites at a deeper level.",
        "Served as a technical sales engineer for high-value prospective customers."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Oklahoma State University",
      "area": "Marketing/Management Science Information Systems",
      "description": "At Oklahoma State University I pursued a double major. My majors were Marketing and Management Science Information Systems. Learning to bridge the gaps between customer-focused business practices and the technologies that enable them were the motivating factors behind this decision.",
      "studyType": "Bachelor of Science",
      "startDate": "2010-05-01",
      "endDate": "2013-05-04",
      "gpa": "2.8",
      "courses": []
    }
  ],

  "awards": [
    
  ],
  "publications": [],
  "skills": [
    {
      "name": "Web Development",
      "level": "Experience with:",
      "keywords": [
        "HTML",
        "CSS",
        "JavaScript",
        "PHP",
        "MySQL",
        "Git",
        "Linux",
        "Vue.js",
        "Bulma",
        "Mustard UI"
      ]
    },
    {
      "name": "API Integration",
      "level": "",
      "keywords": [
        "Reading/understanding technical API documentation.",
        "Writing supplemental API documentation.",
        "Creating code examples for API requests.",
        "Developing REST API test cases.",
        "Troubleshooting/debugging integrations."
      ]
    }
  ],
  "languages": [
    {
      "name": "English",
      "level": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Mental",
      "keywords": [
        "I have been playing guitar since childhood. I enjoy learning new techniques and information to make myself a better player. I also enjoy going to see live music whenever I get the chance."
      ]
    },
    {
      "name": "Physical",
      "keywords": [
        "When given the chance I enjoy rock climbing both indoors and outdoors."
      ]
    }
  ],
  "references": [
    {
      "name": "Chris Stewart",
      "company": "Bluefin",
      "position": "Director of Quality Assurance and Integrations",
      "phone": "(918)720-3271",
      "email": "chris@runslinux.com"
    },
    {
      "name": "Chris Miyata",
      "company": "Bank of Oklahoma",
      "position": "Product Manager Debit Card",
      "phone": "(918)508-9830",
      "email": "chrismiyata@gmail.com"
    },
    {
      "name": "Trevor Hermosillo",
      "company": "Google",
      "position": "Hardware Engineer",
      "phone": "(918)863-9365",
      "email": "thermosillo@google.com"
    }
  ]
}